In [133]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import ttest_1samp, ttest_ind, mannwhitneyu, levene, shapiro
from statsmodels.stats.power import ttest_power
from scipy import stats

In [96]:
df = pd.read_csv('Project-2.csv') # reading data from saved csv file

In [78]:
df.head() # top five elements of the datasets

   SALESPERSON  Old Scheme (in thousands)  New Scheme (in thousands)
0            1                         57                         62
1            2                        103                        122
2            3                         59                         54
3            4                         75                         82
4            5                         84                         84

In [97]:
df.set_index('SALESPERSON',inplace=True)

In [98]:
df

             Old Scheme (in thousands)  New Scheme (in thousands)
SALESPERSON
1                                   57                         62
2                                  103                        122
3                                   59                         54
4                                   75                         82
5                                   84                         84
6                                   73                         86
7                                   35                         32
8                                  110                        104
9                                   44                         38
10                                  82                        107
11                                  67                         84
12                                  64                         85
13                                  78                         99
14                                  53                         39
15                                  41                         34
16                                  39                         58
17                                  80                         73
18                                  87                         53
19                                  73                         66
20                                  65                         78
21                                  28                         41
22                                  62                         71
23                                  49                         38
24                                  84                         95
25                                  63                         81
26                                  77                         58
27                                  67                         75
28                                 101                         94
29                                  91                        100
30                                  50                         68

In [99]:
df.describe()

       Old Scheme (in thousands)  New Scheme (in thousands)
count                  30.000000                  30.000000
mean                   68.033333                  72.033333
std                    20.455980                  24.062395
min                    28.000000                  32.000000
25%                    54.000000                  55.000000
50%                    67.000000                  74.000000
75%                    81.500000                  85.750000
max                   110.000000                 122.000000

In [134]:
#Seperating the two datasets 
df1 = df['Old Scheme (in thousands)']*1000
df1

SALESPERSON
1      57000
2     103000
3      59000
4      75000
5      84000
6      73000
7      35000
8     110000
9      44000
10     82000
11     67000
12     64000
13     78000
14     53000
15     41000
16     39000
17     80000
18     87000
19     73000
20     65000
21     28000
22     62000
23     49000
24     84000
25     63000
26     77000
27     67000
28    101000
29     91000
30     50000
Name: Old Scheme (in thousands), dtype: int64

In [103]:
Mean1 = df1.mean() # mean of the the column Old scheme in thousands
print(Mean1)

68033.33333333333

In [104]:
df2 = df['New Scheme (in thousands)']*1000

In [105]:
Mean2 = df2.mean() # mean of the the column new scheme in thousands
print(Mean2)

72033.33333333333

In [86]:
#print(df2)
#print(df1)

Question 2 : Use the five percent significance test over the data to determine the p value to check new scheme has significantly raised outputs? (10 points)

Solution :
    
> Since population standard deviation is unkown so we are using t-stat test
> Signifance level = 0.05

Hypothesis Formulation 

•H0 (NULL hypothesis) : New scheme has not significantly raised outputs i.e there is no change in means M1 == M2
    
•H1 (Alternate hypothesis) : New scheme has significantly raised outputs i.e there is change in means |M2 -M1| > 0

In [107]:
DiffMean = int(Mean2-Mean1)
print('Mean difference is %d'%(DiffMean))
t_statistic,p_value = ttest_1samp(df2-df1,0)
print('t_statistic is %f , p_value is %f'%(t_statistic,p_value))

Mean difference is 4000
t_statistic is 1.555914 , p_value is 0.130576

In [108]:
statistic ,pvalue =  stats.ttest_rel(df2,df1)
print(statistic ,pvalue)

1.5559143823544377 0.13057553961337662

In [109]:
p_value/2
# Since we have to check if scheme has raised outputs or not

0.06528776980668831

Question 3 : What conclusion does the test (p-value) lead to? (2.5 points)

Answer : Since p-value (=0.06528) is higher than 0.05, we accept NULL hypothesis.
         The new scheme has not significantly raised outputs.

Question 4 

Suppose it has been calculated that in order for Titan to break even, the average output must increase by £5000 in the scheme compared to the old scheme. If this figure is alternative hypothesis, what is:

    a) The probability of a type 1 error? (2.5 points)

    b) What is the p- value of the hypothesis test if we test for a difference of $5000? (10 points)

    c) Power of the test (5 points)

Solution :
    
New Hypothesis Formulation

•Null Hypothesis : the average output must increase by £5000 i.e Mean difference Md = (M1 - M2 ) <=5000
    
•Alternate Hypothesis : the average output must increase by £5000 i.e Mean difference Md = (M1 - M2 ) >5000

Type I error - Rejecting Null hypothesis when it is true 

Probability of Type I error is significant level or aplha, which is given as 0.05 or 5%

• Nulll Hypothesis will be rejected if t_statistic > t_critical

• t_critical = 1.69 for 0.05 signifance level and degree of freedom is (sample size-1) i.e 29

In [110]:
t_critical = stats.t.ppf(1-0.05, 29)
print (t_critical)

1.6991270265334972

In [132]:
t_statistic,p_value = ttest_1samp(df2-df1,5000)
print('t_statistic is %f , p_value is %f'%(t_statistic,p_value))

t_statistic is -0.388979 , p_value is 0.700133

In [135]:
D = ((Mean1- Mean2) - 5000) / np.sqrt(((30-1)*np.var(df1) + (30-1)*np.var(df2)) / 30+30-2)
print(D)

-0.2947956482540291

In [137]:
print(ttest_power(D,alpha=0.05,nobs=30, alternative='smaller'))

0.4728955031575411